js-games.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>CodeLab I, Workshop 20</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Matt Thompson">
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">CodeLab I, Workshop 20</h1>
</header><br>

<div id="outline-container-org1917db7" class="outline-2">
<h2 id="org1917db7">Javascript Game Challenge</h2>
<div class="outline-text-2" id="text-org1917db7">
</div>
<div id="outline-container-org06ab22c" class="outline-3">
<h3 id="org06ab22c">Magic 8-Ball</h3>
<div class="outline-text-3" id="text-org06ab22c">
<p>
Magic 8-balls are toys that are designed to help people make decisions. You ask a question, shake the ball, and it gives you a positive or negative answer.
</p>

<p>
Create a web page with an image of a magic 8-ball and a button that says something like "shake me". When you click on the button, some text should appear with positive, negative, or vague phrases such as: "it looks doubtful", "it appears certain", "the outcome is unclear" or "shake again to find out".
</p>

<p>
This should involve the simple creation of an array, and the random selection of an element from it. The code below
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #75715E;">// </span><span style="color: #75715E;">a javascript array:</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">myArray</span> = <span style="color: #AE81FF;">[</span><span style="color: #E6DB74;">"apples"</span>, <span style="color: #E6DB74;">"oranges"</span>, <span style="color: #E6DB74;">"pears"</span>, <span style="color: #E6DB74;">"apricots"</span><span style="color: #AE81FF;">]</span>;

<span style="color: #75715E;">// </span><span style="color: #75715E;">generate a random number between 0 and the array length</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">rand</span> = Math.floor<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">(</span>Math.random<span style="color: #A6E22E;">()</span> * myArray.length<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>;

<span style="color: #75715E;">// </span><span style="color: #75715E;">print a random number</span>
console.log<span style="color: #AE81FF;">(</span>myArray<span style="color: #66D9EF;">[</span>rand<span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd30fdd5" class="outline-3">
<h3 id="orgd30fdd5">Rock, Paper, Scissors</h3>
<div class="outline-text-3" id="text-orgd30fdd5">
<p>
Create a game of "rock, paper, scissors" in Javascript. There should be three buttons or images on the page: "rock", "paper", and "scissors". The player clicks on one, and the computer randomly chooses a response. The winner is then determined through these rules:
</p>

<ul class="org-ul">
<li>rock beats scissors</li>
<li>scissors beats paper</li>
<li>paper beats rock</li>
</ul>

<p>
For added fun, try implementing a "best 2 of 3" or "best 3 of 5" mode.
</p>
</div>
</div>
</div>
</div>
</body>
</html>